app/controllers/items_controller.rb

  def create
    @todo.items.create!(item_params)
---
INSERT INTO "items" ("name", "done", "todo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Visit Narnia"], ["done", 0], ["todo_id", 1], ["created_at", "2020-03-03 12:09:09.321371"], ["updated_at", "2020-03-03 12:09:09.321371"]]

  def update
    @item.update(item_params)
---
UPDATE "items" SET "name" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "Mozart"], ["updated_at", "2020-03-03 12:09:09.523956"], ["id", 1]]

  def set_todo
    @todo = Todo.find(params[:todo_id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def set_todo_item
    @item = @todo.items.find_by!(id: params[:id]) if @todo
---
SELECT "items".* FROM "items" WHERE "items"."todo_id" = ? AND "items"."id" = ? LIMIT ?  [["todo_id", 1], ["id", 1], ["LIMIT", 1]]