app/controllers/todos_controller.rb

INSERT INTO "todos" ("title", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Learn Elm"], ["created_by", "1"], ["created_at", "2020-03-03 11:53:55.294955"], ["updated_at", "2020-03-03 11:53:55.294955"]]
---
  def create
    @todo = Todo.create!(todo_params)

UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Shopping"], ["updated_at", "2020-03-03 11:53:55.425899"], ["id", 1]]
---
  def update
    @todo.update(todo_params)